src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды/Forms/РегистрацияШтрихкодовНоменклатуры/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем НеПредупреждатьОЗакрытии;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НеизвестныеШтрихкоды") Тогда
		Для Каждого СтрокаШтрихкода Из Параметры.НеизвестныеШтрихкоды Цикл
			НовыйШтрихкод = ШтрихкодыНоменклатуры.Добавить();
			НовыйШтрихкод.Штрихкод = СтрокаШтрихкода.Штрихкод;
			НовыйШтрихкод.Количество = СтрокаШтрихкода.Количество;
		КонецЦикла;
	КонецЕсли;
	
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если Не ВебКлиент Тогда
		Сигнал();
	#КонецЕсли
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НеПредупреждатьОЗакрытии <> Истина Тогда 
		
		Отказ = Истина;
		ТекстВопроса = НСтр("ru='Товары не будут перенесены в документ.
	                        	|Отложите их в сторону как неотсканированные.'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		НеПредупреждатьОЗакрытии = Истина;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Объект КАК Объект,
	|	Штрихкоды.ПартииНоменклатуры КАК ПартииНоменклатуры,
	|	Штрихкоды.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод В(&Штрихкоды)";
	
	Запрос.УстановитьПараметр("Штрихкоды", ШтрихкодыНоменклатуры.Выгрузить(Новый Структура("Зарегистрирован", Ложь),"Штрихкод").ВыгрузитьКолонку("Штрихкод"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда // Штрихкод уже записан в БД
		
		СтрокаТЧ = ШтрихкодыНоменклатуры.НайтиСтроки(Новый Структура("Штрихкод", Выборка.Штрихкод))[0];
		
		ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.Объект + """"
		                + ?(ЗначениеЗаполнено(Выборка.ПартииНоменклатуры), " " + НСтр("ru='с партией'") + " """ + Выборка.ПартииНоменклатуры + """", "")
		                + ?(ЗначениеЗаполнено(Выборка.Упаковка), " """ + НСтр("ru='в упаковке'") + " " + Выборка.Упаковка + """", ""));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,"ШтрихкодыНоменклатуры["+ШтрихкодыНоменклатуры.Индекс(СтрокаТЧ)+"].Штрихкод",,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШтрихкодыНоменклатуры

&НаКлиенте
Процедура ШтрихкодыНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	ТекущаяСтрока.Упаковка = Неопределено;
	ТекущаяСтрока.ПартииНоменклатуры = Неопределено;
	ТекущаяСтрока.ПартииИспользуются = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ТекущаяСтрока.Объект, "ИспользоватьПартии");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте 
// Процедура - Перенести в документ
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПеренестиВДокумент(Команда)
	
	ОчиститьСообщения();
	ПараметрЗакрытия = ЗарегистрироватьШтрихкодыНаСервере();
	ПараметрЗакрытия.Вставить("ФормаВладелецУникальныйИдентификатор", ВладелецФормы.УникальныйИдентификатор);
		
	Если ПараметрЗакрытия <> Неопределено Тогда
		Если ПараметрЗакрытия.НайденыНезарегистрированныеТовары Тогда
			ТекстВопроса = НСтр("ru='Не для всех новых штрихкодов указана соответствующая номенклатура.
			                        |Эти товары не будут перенесены в документ.
			                        |Отложите их в сторону как неотсканированные.'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ПеренестиВДокументЗавершение", ЭтотОбъект, Новый Структура("ПараметрЗакрытия", ПараметрЗакрытия)), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
            Возврат;
		КонецЕсли;
		ПеренестиВДокументФрагмент(ПараметрЗакрытия);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Перенести в документ завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПеренестиВДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрЗакрытия = ДополнительныеПараметры.ПараметрЗакрытия;
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиВДокументФрагмент(ПараметрЗакрытия);

КонецПроцедуры

&НаКлиенте
// Процедура - Перенести в документ фрагмент
//
// Параметры:
//  ПараметрЗакрытия - 	 - 
//
Процедура ПеренестиВДокументФрагмент(Знач ПараметрЗакрытия)
	
	НеПредупреждатьОЗакрытии = Истина;
	Закрыть();
	Оповестить("НеизвестныеШтрихкоды", ПараметрЗакрытия, "ВнешнееОборудование");

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ПодключаемоеОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрикодов)
	
	Для Каждого ЭлементДанных Из ДанныеШтрикодов Цикл
		ДанныеШтрихкода = ПолучитьДанныеШтрихкода(ЭлементДанных.Штрихкод);
		Если ДанныеШтрихкода <> Неопределено Тогда		
			НайденныеСтроки = ШтрихкодыНоменклатуры.НайтиСтроки(Новый Структура("Штрихкод", ЭлементДанных.Штрихкод));
			Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
				СтрокаТЗ.Объект   = ДанныеШтрихкода.Объект;
				СтрокаТЗ.ПартииНоменклатуры = ДанныеШтрихкода.ПартииНоменклатуры;
				СтрокаТЗ.Упаковка = ДанныеШтрихкода.Упаковка;
				СтрокаТЗ.Зарегистрирован = Истина;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеШтрихкода(Штрихкод)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штрихкоды.Объект,
	|	Штрихкоды.ПартииНоменклатуры,
	|	Штрихкоды.Упаковка
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеШтрихкода = Новый Структура("Объект, ПартииНоменклатуры, Упаковка");
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, Выборка);
		Возврат ДанныеШтрихкода;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗарегистрироватьШтрихкодыНаСервере()
	
	Если ПроверитьЗаполнение() Тогда
	
		Для Каждого СтрокаШтрихкода Из ШтрихкодыНоменклатуры Цикл
			
			Если СтрокаШтрихкода.Зарегистрирован 
					ИЛИ Не ЗначениеЗаполнено(СтрокаШтрихкода.Объект)
					ИЛИ (СтрокаШтрихкода.ПартииИспользуются И Не ЗначениеЗаполнено(СтрокаШтрихкода.ПартииНоменклатуры))Тогда				
				Продолжить;
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод 			= СтрокаШтрихкода.Штрихкод;
			МенеджерЗаписи.Объект 				= СтрокаШтрихкода.Объект;
			МенеджерЗаписи.ПартииНоменклатуры 	= СтрокаШтрихкода.ПартииНоменклатуры;
			МенеджерЗаписи.Упаковка 			= СтрокаШтрихкода.Упаковка;
			МенеджерЗаписи.Записать();
			
			СтрокаШтрихкода.ЗарегистрированОбработкой = Истина;
			
		КонецЦикла;
		
		ЗарегистрированныеШтрихкоды = Новый Массив;
		НайденныеШтрихкоды = ШтрихкодыНоменклатуры.НайтиСтроки(Новый Структура("ЗарегистрированОбработкой", Истина));
		Для Каждого СтрокаШтрихкода Из НайденныеШтрихкоды Цикл
			ЗарегистрированныеШтрихкоды.Добавить(Новый Структура("Штрихкод, Количество", СтрокаШтрихкода.Штрихкод, СтрокаШтрихкода.Количество));
		КонецЦикла;
		НайденныеШтрихкоды = ШтрихкодыНоменклатуры.НайтиСтроки(Новый Структура("Зарегистрирован", Истина));
		Для Каждого СтрокаШтрихкода Из НайденныеШтрихкоды Цикл
			ЗарегистрированныеШтрихкоды.Добавить(Новый Структура("Штрихкод, Количество", СтрокаШтрихкода.Штрихкод, СтрокаШтрихкода.Количество));
		КонецЦикла;
		
		НезарегистрированныеШтрихкоды = Новый Массив;
		НайденныеШтрихкоды = ШтрихкодыНоменклатуры.НайтиСтроки(Новый Структура("Зарегистрирован, ЗарегистрированОбработкой", Ложь, Ложь));
		Для Каждого СтрокаШтрихкода Из НайденныеШтрихкоды Цикл
			НезарегистрированныеШтрихкоды.Добавить(Новый Структура("Штрихкод, Количество", СтрокаШтрихкода.Штрихкод, СтрокаШтрихкода.Количество));
		КонецЦикла;
		
		ПараметрЗакрытия = Новый Структура("ЗарегистрированныеШтрихкоды, НезарегистрированныеШтрихкоды, НайденыНезарегистрированныеТовары", ЗарегистрированныеШтрихкоды, НезарегистрированныеШтрихкоды, НезарегистрированныеШтрихкоды.Количество() > 0);
		
		Возврат ПараметрЗакрытия;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура, обработчик события "НачалоВыбора" поле ввода "Упаковка"
//
&НаКлиенте
Процедура УпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличныхЧастейКлиент.ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные, "Объект");
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ПартииНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.ШтрихкодыНоменклатуры.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Объект) Тогда
		ЗначениеОтбора = Новый Структура("Владелец", ТекущаяСтрока.Объект);
		ПараметрыВыбораСписка = Новый Структура("Отбор", ЗначениеОтбора);
		ПараметрыВыбораСписка.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		ПараметрыВыбораСписка.Вставить("Дата", ТекущаяДата());
		ПараметрыВыбораСписка.Вставить("МножественныйВыбор", Истина);
		ПараметрыВыбораСписка.Вставить("ОтборПоПартиям", Ложь);
		ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", ПараметрыВыбораСписка,,,,, Новый ОписаниеОповещения("ПартииНоменклатурыНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартииНоменклатурыНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;	
	Если НЕ Результат = Неопределено Тогда
		ТекущаяСтрока.ПартииНоменклатуры = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
